 *TO DISPLAY 1D TABLE
       ID DIVISION.
       PROGRAM-ID. TABLE1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STD-REC.
          05 STD-ROLL PIC 9(4).
          05 STD-NAME PIC A(20).
          05 STD-MK   PIC 9(3) OCCURS 3 TIMES INDEXED BY A1.
       PROCEDURE DIVISION.
           PERFORM ACC-PARA.
           PERFORM DISP-PARA.
           STOP RUN.
       ACC-PARA.
           ACCEPT STD-ROLL.
           ACCEPT STD-NAME.
           PERFORM ACC-PARA1 VARYING A1 FROM 1 BY 1 UNTIL A1 > 3.
       ACC-PARA1.
           ACCEPT STD-MK ( A1 ).
       DISP-PARA.
           DISPLAY STD-ROLL.
           DISPLAY STD-NAME.
           PERFORM DISP-PARA1 VARYING A1 FROM 1 BY 1 UNTIL A1 > 3.
       DISP-PARA1.
           DISPLAY STD-MK ( A1 ).
