 *TO DISPLAY 1D TABLE
       ID DIVISION.
       PROGRAM-ID. TABLE1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STD-REC.
          05 STD-ROLL PIC 9(4).
          05 STD-NAME PIC A(20).
          05 STD-MK   PIC 9(3) OCCURS 3 TIMES INDEXED BY A1.
       PROCEDURE DIVISION.
           PERFORM ACC-PARA.
           PERFORM DISP-PARA.
           STOP RUN.
