 *TO DISPLAY 2D TABLE
       ID DIVISION.
       PROGRAM-ID. TABLE1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STD-DET.
          05 STD-REC OCCURS 2 TIMES INDEXED BY A1.
             10 STD-ROLL PIC 9(4).
             10 STD-NAME PIC A(20).
             10 STD-MK   PIC 9(3) OCCURS 3 TIMES INDEXED BY B1.
       PROCEDURE DIVISION.
           PERFORM ACC-PARA VARYING A1 FROM 1 BY 1 UNTIL A1 > 2.
           PERFORM DISP-PARA VARYING A1 FROM 1 BY 1 UNTIL A1 > 2.
           STOP RUN.
       ACC-PARA.
           ACCEPT STD-ROLL ( A1 ) .
           ACCEPT STD-NAME ( A1 ).
           PERFORM ACC-PARA1 VARYING B1 FROM 1 BY 1 UNTIL B1 > 3.
       ACC-PARA1.
           ACCEPT STD-MK ( A1 , B1 ).
       DISP-PARA.
           DISPLAY STD-ROLL ( A1 ).
           DISPLAY STD-NAME ( A1 ).
           PERFORM DISP-PARA1 VARYING B1 FROM 1 BY 1 UNTIL B1 > 3.
       DISP-PARA1.
           DISPLAY STD-MK ( A1 , B1 ).
