  *TO DISPLAY 3D TABLE
       ID DIVISION.
       PROGRAM-ID. ITABLE3.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ALL-DET.
          05 SCH-REC OCCURS 2 TIMES INDEXED A1.
             10 SCHOOL-NAME PIC X(20).
             10 STD-DET OCCURS 2 TIMES INDEXED B1.
                15 STD-ROLL PIC 9(4).
                15 STD-NAME PIC A(20).
                15 STD-MK   PIC 9(3) OCCURS 3 TIMES INDEXED C1.
       PROCEDURE DIVISION.
           PERFORM ACC-PARA VARYING A1 FROM 1 BY 1 UNTIL A1 > 2.
           PERFORM DISP-PARA VARYING A1 FROM 1 BY 1 UNTIL A1 > 2.
           STOP RUN.
       ACC-PARA.
           ACCEPT SCHOOL-NAME ( A1 ) .
           PERFORM ACC-PARA1 VARYING B1 FROM 1 BY 1 UNTIL B1 > 2.
       ACC-PARA1.
           ACCEPT STD-ROLL ( A1 , B1 ).
           ACCEPT STD-NAME ( A1 , B1 ).
           PERFORM ACC-PARA2 VARYING C1 FROM 1 BY 1 UNTIL C1 > 3.
       ACC-PARA2.
           ACCEPT STD-MK ( A1 , B1 , C1 ).
       DISP-PARA.
           DISPLAY SCHOOL-NAME ( A1 ).
           PERFORM DISP-PARA1 VARYING B1 FROM 1 BY 1 UNTIL B1 > 2.
       DISP-PARA1.
           DISPLAY STD-ROLL ( A1 , B1 ).
           DISPLAY STD-NAME ( A1 , B1 ).
           PERFORM DISP-PARA2 VARYING C1 FROM 1 BY 1 UNTIL C1 > 3.
       DISP-PARA2.
           DISPLAY STD-MK ( A1 , B1 , C1 ).
