 *TO COPY A PS FILE TO OTHER PS
       ID DIVISION.
       PROGRAM-ID. FILECOP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO DDX1
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS FSTAT1.
           SELECT OUTFILE ASSIGN TO DDX2
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS FSTAT2.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INEMP-REC.
          05 INEMPNO PIC X(4).
          05 INEMPNM PIC A(7).
          05 INEMPSA PIC 9(4).
          05 INEMPPA PIC 9(5).
       FD OUTFILE.
       01 OUTEMP-REC.
          05 OUTEMPNO PIC X(4).
          05 OUTEMPNM PIC A(7).
          05 OUTEMPSA PIC 9(4).
          05 OUTEMPPA PIC 9(5).
          05 FILLER   PIC X(60).
       WORKING-STORAGE SECTION.
       77 FSTAT1 PIC 9(2) VALUE 0.
       77 FSTAT2 PIC 9(2) VALUE 0.
       77 EOF    PIC A(1) VALUE 'N'.
       PROCEDURE DIVISION.
           PERFORM OPEN-PARA.
           PERFORM PROCESS-PARA UNTIL EOF = 'Y'.
           PERFORM CLOSE-PARA.
           STOP RUN.
       OPEN-PARA.
           OPEN INPUT INFILE , OUTPUT OUTFILE.
           READ INFILE AT END MOVE 'Y' TO EOF.
       PROCESS-PARA.
           MOVE INEMPNO TO OUTEMPNO
           MOVE INEMPNM TO OUTEMPNM
           MOVE INEMPSA TO OUTEMPSA
           MOVE INEMPPA TO OUTEMPPA
           WRITE OUTEMP-REC.
           READ INFILE AT END MOVE 'Y' TO EOF.
       CLOSE-PARA.
           CLOSE INFILE , OUTFILE.
