 *TO CREATE A REPORT
       ID DIVISION.
       PROGRAM-ID. KSPATH.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INFILE ASSIGN TO DDX1
           ORGANIZATION IS INDEXED
           ACCESS MODE IS RANDOM
           RECORD KEY IS  INEMPNO
           ALTERNATE KEY IS INEMPPA
           FILE STATUS IS FSTAT1.
           SELECT OUTFILE ASSIGN TO DDX2
           ORGANIZATION IS SEQUENTIAL
           ACCESS MODE IS SEQUENTIAL
           FILE STATUS IS FSTAT2.
       DATA DIVISION.
       FILE SECTION.
       FD INFILE.
       01 INEMP-REC.
          05 INEMPNO PIC X(4).
          05 INEMPNM PIC A(6).
          05 INEMPGE PIC A(1).
          05 INEMPSA PIC 9(4).
          05 INEMPPA PIC X(5).
       FD OUTFILE.
       01 OUTEMP-REC.
          05 OUTEMPNO PIC X(4).
          05 FILLER   PIC X(11).
          05 OUTEMPNM PIC A(6).
          05 FILLER   PIC X(10).
          05 OUTEMPSA PIC 9(4).
          05 FILLER   PIC X(11).
          05 OUTEMPPA PIC X(5).
          05 FILLER   PIC X(29).
       WORKING-STORAGE SECTION.
       01 HD1.
          05 FILLER PIC X(20) VALUE SPACES.
          05 FILLER PIC X(20) VALUE 'COFORGE TECHNOLOGY'.
          05 FILLER PIC X(40) VALUE SPACES.
       01 HD2.
          05 FILLER PIC X(20) VALUE SPACES.
          05 FILLER PIC X(18) VALUE ALL '-'.
          05 FILLER PIC X(42) VALUE SPACES.
       01 HD3.
          05 FILLER PIC X(5) VALUE 'EMPNO'.
          05 FILLER PIC X(10) VALUE SPACES.
          05 FILLER PIC X(7) VALUE 'EMPNAME'.
          05 FILLER PIC X(10) VALUE SPACES.
          05 FILLER PIC X(6) VALUE 'SALARY'.
          05 FILLER PIC X(9) VALUE SPACES.
          05 FILLER PIC X(5) VALUE 'PANNO'.
          05 FILLER PIC X(28) VALUE SPACES.
       01 HD4.
          05 FILLER PIC X(80) VALUE ALL '-'.
       01 HD5.
          05 FILLER PIC X(15) VALUE SPACES.
          05 FILLER PIC X(5) VALUE 'TOTAL'.
          05 FILLER PIC X(12) VALUE SPACES.
          05 TOTSAL PIC X(7).
          05 FILLER PIC X(41) VALUE SPACES.
       77 FSTAT1 PIC 9(2) VALUE 0.
       77 FSTAT2 PIC 9(2) VALUE 0.
       77 EOF    PIC A(1) VALUE 'N'.
       PROCEDURE DIVISION.
           PERFORM OPEN-PARA.
           PERFORM PROCESS-PARA.
           PERFORM CLOSE-PARA.
           STOP RUN.
       OPEN-PARA.
           OPEN INPUT INFILE , OUTPUT OUTFILE.
           WRITE OUTEMP-REC FROM HD1.
           WRITE OUTEMP-REC FROM HD2.
           WRITE OUTEMP-REC FROM HD3.
           WRITE OUTEMP-REC FROM HD4.
           MOVE 'PA107' TO INEMPPA.
           READ INFILE KEY IS INEMPPA INVALID KEY
                  DISPLAY 'NO RECORD'.
       PROCESS-PARA.
           DISPLAY INEMP-REC.
           MOVE INEMPNO TO OUTEMPNO
           MOVE INEMPNM TO OUTEMPNM
           MOVE INEMPSA TO OUTEMPSA
           MOVE INEMPPA TO OUTEMPPA
           WRITE OUTEMP-REC.
       CLOSE-PARA.
           WRITE OUTEMP-REC FROM HD4.
           CLOSE INFILE , OUTFILE.
